Autodesk.Revit.DB.Segment.RemoveSize(System.Double)
Remove the existing MEPSize with this nominal diameter from the segment.
Remarks:
Does nothing if there is no existing MEPSize with this nominal diameter.
nominalDiameter:
The nominal diameter of the size.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The last size of the segment cannot be removed.
Since:
2013

Autodesk.Revit.DB.Segment.AddSize(Autodesk.Revit.DB.MEPSize)
Adds a new MEPSize to the segment.
size:
The new MEPSize to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is already a same size in the settings.
-or-
The size already exists in the segment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Segment.Roughness
The roughness value for given material.
Since:
2013

Autodesk.Revit.DB.Segment.Description
The description of the segment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013